InformationRegisters/ЗадачиОбратныйЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗадачиОбратныйЗвонок</Name>
			<Comment>Задачи на обратный звонок</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип задачи</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПостановки</Name>
					<Comment>Дата постановки задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокЗакрытия</Name>
					<Comment>Сигнатура звонка закрывшего задачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокИнициатор</Name>
					<Comment>Сигнатура непринятого звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Дата до которой необходимо исполнить задачу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоИнициатор</Name>
					<Comment>MessageID письма эл. почты для почтового сообщения/ имя сайта для автозвонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеПерезвонить</Name>
					<Comment>Напоминание в часах о необходимости перезвона</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПерезвона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПлан</Name>
					<Comment>Предполагаемый исполнитель задачи</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоИсполнительПлан</Name>
					<Comment>Предполагаемый  соисполнитель задачи (напр. непосредственный руководитель)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоИсполнителиПлан</Name>
					<Comment>Адресаты из поля копия, из их адресов эл. почты получены ФИО</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Сигнатура интернет-заявки, по которой задача по интернет-заявке закрылась и была создана задача на обратный звонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ТипЗадачи</Name>
			<Comment>Тип задачи</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Непринятый</Name>
					<Comment>Перезвонить абоненту непринятого звонка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛояльностьПродажАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛояльностьРемонтаАвто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяПочта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепринятыйИсходящий</Name>
					<Comment>Относится к автозвонку (был исходящий со стороны КЦ, но он не принят абонентом)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сброс</Name>
					<Comment>Задача создана вручную операторм контакт-центра из консоли, т.к. он посчитал, что произошел сброс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗадачиОбратныйЗвонок/Ext/ManagerModule.bsl
Функция УстановиЗначениеРеквизита(Телефон, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	Доступно = Доступно И ТипЗнч(ЗначениеРеквизита)<> Тип("Неопределено");
	Доступно = Доступно И ЗначениеЗаполнено(ЗначениеРеквизита);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ 				= 	РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	НЗ.Телефон		=	Телефон;
	НЗ.ДатаЗакрытия	=	'00010101';
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Телефон 		=	Телефон;
	НЗ.ДатаЗакрытия =	'00010101';
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		
		НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен "  +ИмяРеквизита+ " с """+НЗ[Рекв.Имя]+""" на """+ЗначениеРеквизита+""" пользователем "+ПараметрыСеанса.ТекущийПользователь;
		НЗ[Рекв.Имя] = ЗначениеРеквизита;
		ИзмененоЗначениеРеквизита = Истина;
		Прервать;
	КонецЦикла;

	
	Если Не ИзмененоЗначениеРеквизита Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецЕсли;

	Попытка
			НЗ.Записать();
			Возврат Истина;
	Исключение
			ЗаписьЖурналаРегистрации("УстановиЗначениеРеквизита()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок, , ОписаниеОшибки());
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
		
КонецФункции

Функция УстановиЗначениеРеквизитаИЗакройЗадачу(Телефон, ДатаЗакрытия, ИмяРеквизита, ЗначениеРеквизита, ТекущийПользователь="") Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = ЛОЖЬ;
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия)=Тип("Дата");
	Доступно = Доступно И ЗначениеЗаполнено(ДатаЗакрытия);
	Доступно = Доступно И ТипЗнч(ИмяРеквизита)=Тип("Строка");
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	НЗ.Телефон=Телефон;
	НЗ.ДатаЗакрытия=Дата("00010101");
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	ИзмененоЗначениеРеквизита = Ложь;
	НЗ.Телефон = НЗ.Телефон;
	НЗ.ДатаЗакрытия = НЗ.ДатаЗакрытия;
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
		Если Рекв.Имя <> ИмяРеквизита Тогда
			Продолжить
		КонецЕсли;
		Если Не Рекв.Тип.СодержитТип(ТипЗнч(ЗначениеРеквизита)) Тогда
			Продолжить
		КонецЕсли;
		 НЗ[Рекв.Имя] = ЗначениеРеквизита;
		 ИзмененоЗначениеРеквизита = ИСТИНА;
		 Прервать;
	КонецЦикла;
	
	Если ИзмененоЗначениеРеквизита Тогда
		НЗ.ДатаЗакрытия = ДатаЗакрытия;
		Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
			НЗ.Исполнитель = ТекущийПользователь;
		КонецЕсли;
		Попытка
			НЗ.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("РегистрСведений.ЗадачиОбратныйЗвонок.УстановиЗначениеРеквизитаИЗакройЗадачу()",, ,, "Ошибка записи");
			Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
		КонецПопытки;
		
		Возврат ИСТИНА;
		
	КонецЕсли;
	
	
КонецФункции

Функция УстановиЗначениеИзмерения(Телефон, НовыйТелефон, ДатаЗакрытия='00010101000000', НоваяДатаЗакрытия='00010101000000') Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = ЛОЖЬ;
	 
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Телефон);
	Доступно = Доступно И ТипЗнч(НовыйТелефон) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(НовыйТелефон);
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия)=Тип("Дата");
	Доступно = Доступно И ТипЗнч(НоваяДатаЗакрытия)=Тип("Дата");

	НЗ = РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	НЗ.Телефон=Телефон;
	НЗ.ДатаЗакрытия = ДатаЗакрытия;
	НЗ.Прочитать();
	
	Если Не НЗ.Выбран() Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
 
	НЗ.Телефон = НовыйТелефон;
	НЗ.ДатаЗакрытия = НоваяДатаЗакрытия;
	
	Для Каждого Рекв Из Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок.Реквизиты Цикл
		НЗ[Рекв.Имя] = НЗ[Рекв.Имя];
	КонецЦикла;
	
	НЗ.Комментарий = НЗ.Комментарий + Символы.ПС+" "+ТекущаяДата()+" изменен телефон с "+Телефон +" на "+НовыйТелефон+" пользователем "+ПараметрыСеанса.ТекущийПользователь;
	
	Попытка
		НЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("РегистрСведений.ЗадачиОбратныйЗвонок.УстановиЗначениеИзмерения()",, ,, "Ошибка записи");
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ;
	КонецПопытки;
	
	Возврат ИСТИНА;

КонецФункции

Функция Добавить(Телефон, ДатаЗакрытия='00010101000000', Тип, Исполнитель, Комментарий="", ДатаПостановки = '00010101000000', ЗвонокИнициатор = "", ДатаАктуальности='00010101000000', ПисьмоИнициатор = "", СоИсполнительПлан = Неопределено, СоИсполнителиПлан="", Основание = "") Экспорт
	//ЗвонокИнициатор - сигнатура звонка
	
	ЗначениеПоУмолчанию = Ложь;
	
	//Проверка типов значений
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И СтрДлина(СокрЛП(Телефон))>=10;
	Доступно = Доступно И СтрНайти(Телефон, "<UNKNOWN>") = Ложь;
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия) = Тип("Дата"); 
	
	Данные = "Телефон = "+ Телефон +" ;ДатаЗакрытия = "+ДатаЗакрытия+" ;ПисьмоИнициатор = "+ПисьмоИнициатор;

	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок, Данные , "Ошибка проверки типов и заполнения аргументов");
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
		
	НЗ = РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	НЗ.Телефон 			= Телефон;
	НЗ.ДатаЗакрытия 	= ДатаЗакрытия;
	НЗ.Прочитать();
	Если НЗ.Выбран() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	НЗ.Телефон 			= Телефон;
	НЗ.ДатаЗакрытия 	= ДатаЗакрытия;
	НЗ.Тип				= Тип;
	НЗ.Исполнитель 		= Исполнитель;
	НЗ.Комментарий		= Комментарий;
	НЗ.ДатаПостановки	= ДатаПостановки;
	НЗ.ЗвонокИнициатор  = ЗвонокИнициатор;
	НЗ.ДатаАктуальности = ДатаАктуальности;
	НЗ.ПисьмоИнициатор  = ПисьмоИнициатор;
	НЗ.ИсполнительПлан	= Исполнитель;
	
	Если СоИсполнительПлан <> Неопределено Тогда
	    НЗ.СоИсполнительПлан =СоИсполнительПлан;
	КонецЕсли;
	
	НЗ.Основание		= Основание;
		
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Комментарий = "Ошибка добавления записи. Описание ошибки: "+ ОписаниеОшибки;
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки
КонецФункции

Функция ДобавитьСЗаменой(Телефон, ДатаЗакрытия='00010101000000', Тип, Исполнитель, Комментарий="", ДатаПостановки = '00010101000000', ЗвонокИнициатор = "", ДатаАктуальности='00010101000000', ПисьмоИнициатор = "", СоИсполнительПлан = Неопределено, СоИсполнителиПлан="", Основание = "") Экспорт
	//В отличие от Добавить(), если находит открытую задачу, то не завершается, а изменяет в ней реквизиты
	
	ЗначениеПоУмолчанию = Ложь;
	
	//Проверка типов значений
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И СтрДлина(СокрЛП(Телефон))>=10;
	Доступно = Доступно И СтрНайти(Телефон, "<UNKNOWN>") = Ложь;
	Доступно = Доступно И ТипЗнч(ДатаЗакрытия) = Тип("Дата"); 
	
	Данные = "Телефон = "+ Телефон +" ;ДатаЗакрытия = "+ДатаЗакрытия+" ;ПисьмоИнициатор = "+ПисьмоИнициатор;

	Если Не Доступно Тогда
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок, Данные , "Ошибка проверки типов и заполнения аргументов");
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
		
	НЗ = РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	НЗ.Телефон 			= Телефон;
	НЗ.ДатаЗакрытия 	= ДатаЗакрытия;
	НЗ.Прочитать();
	
	//Не зависимо от того, найдена ли существующая открытая задача, создай новую
	//---------------------------------------------------------------------------
	
	НЗ.Телефон 			= Телефон;
	НЗ.ДатаЗакрытия 	= ДатаЗакрытия;
	НЗ.Тип				= Тип;
	НЗ.Исполнитель 		= Исполнитель;
	Если ЗначениеЗаполнено(НЗ.Комментарий) Тогда
		НЗ.Комментарий		= НЗ.Комментарий+";"+Символы.ПС+Комментарий;
	Иначе
		НЗ.Комментарий		= Комментарий;
	КонецЕсли;
	НЗ.ДатаПостановки	= ДатаПостановки;
	НЗ.ЗвонокИнициатор  = ЗвонокИнициатор;
	НЗ.ДатаАктуальности = ДатаАктуальности;
	НЗ.ПисьмоИнициатор  = ПисьмоИнициатор;
	НЗ.ИсполнительПлан	= Исполнитель;
	
	Если СоИсполнительПлан <> Неопределено Тогда
	    НЗ.СоИсполнительПлан =СоИсполнительПлан;
	КонецЕсли;
	
	НЗ.Основание		= Основание;
		
	Попытка
		НЗ.Записать();
		Возврат Истина;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Комментарий = "Ошибка добавления записи. Описание ошибки: "+ ОписаниеОшибки;
		ЗаписьЖурналаРегистрации("Добавить()", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗадачиОбратныйЗвонок, Данные, Комментарий);
		Возврат Ложь;
	КонецПопытки
КонецФункции

Функция ЗакрытьАвтоматически(Телефон, ТелефонСотрудникаОП, СигнатураПропущенногоЗвонка) Экспорт
		
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Ложь;
	
	Доступно = ТипЗнч(Телефон) = Тип("Строка");
	Доступно = Доступно И СтрДлина(СокрЛП(Телефон))>=10;
	Доступно = Доступно И ТипЗнч(ТелефонСотрудникаОП) = Тип("Строка");
	Доступно = Доступно И СтрДлина(СокрЛП(ТелефонСотрудникаОП))=4;	
	
	Если Не Доступно Тогда
		Возврат "Попытка автозакрытия. Неудача. Ошибка в аргументах";
	КонецЕсли;
	
	Зап = РегистрыСведений.ЗадачиОбратныйЗвонок.СоздатьМенеджерЗаписи();
	Зап.Телефон 			= Телефон;
	Зап.ДатаЗакрытия 	= '00010101000000'; 
	Зап.Прочитать();
	Если Не Зап.Выбран() Тогда
		Возврат "Попытка автозакрытия. Неудача. Открытая задача не найдена";
	КонецЕсли; 
	
	//Найди внутр. тел. сотрудника ОП в справочнике
	//----------------------------------------------------------------------------------
	ТелСсылка = Справочники.ТелВнутренние.НайтиПоКоду(ТелефонСотрудникаОП);
	Если ТелСсылка = Справочники.ТелВнутренние.ПустаяСсылка() Тогда
		Возврат "Попытка автозакрытия. Неудача. Не найден внутр. телефон в справочнике";
	КонецЕсли;

	//Если оказались здесь, значит почтовое сообщение успешно отправлено, переопределим исполнителя задачи
	//-------------------------------------------------------------------------------------------------------
	
	Зап.ДатаАктуальности = ТекущаяДата() + 600*6;	
	Зап.Тип = Перечисления.ТипЗадачи.Непринятый; //default value	
	
	Зап.Комментарий = Зап.Комментарий	+ ". Закрыта автоматом отправкой пропущенного звонка в ОУ";
	Зап.Исполнитель 		= ТелСсылка;
	Зап.ИсполнительПлан 	= ТелСсылка;
	Зап.ДатаЗакрытия		= ТекущаяДата();
	
	Попытка
		Зап.Записать();
	Исключение
		Данные = "Телефон="+Зап.Телефон+" ;ДатаПостановки="+Зап.ДатаПостановки;
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("СоздатьЗадачу()", УровеньЖурналаРегистрации.Ошибка, Данные, Комментарий);
		Возврат "Попытка автозакрытия. Неудача. Ошибка записи задачи при смене исполнителя";
	КонецПопытки;
		
	Возврат "Попытка автозакрытия. Успех";

КонецФункции

Функция ЗакройНетПерезвона(ДатаПостановки) Экспорт
	// Закрывает задачи с датой постановки меньшей или равной переданной
	
	Доступно = 		ТипЗнч(ДатаПостановки) = Тип("Дата")
				И 	ЗначениеЗаполнено(ДатаПостановки);	
	Если Не Доступно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Текст = "ВЫБРАТЬ Т.Телефон КАК Телефон ИЗ РегистрСведений.ЗадачиОбратныйЗвонок КАК Т ГДЕ Т.ДатаЗакрытия = &ДатаЗакрытия И Т.ДатаПостановки <= &ДатаПостановки";
	Парам = Новый Структура("ДатаЗакрытия, ДатаПостановки", '00010101', ДатаПостановки);
	Рез = ОбщегоНазначения.ЗапросВыполнить(Текст, Парам);
	Если Рез.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ТекДата = ТекущаяДата();
	
	// Переменная будет содержать список номеров телефонов задач, при закрытии которых возникнут ошибки
	//--------------------------------------------------------------------------------------------------
	ТелефоныЗадачОшибкиЗакрытия = "";
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл	
		Выполнено = УстановиЗначениеРеквизитаИЗакройЗадачу(Выб.Телефон, ТекДата, "ПричинаЗакрытия", "Автозакрытие по причине отсутствия перезвона");
		
		Если Не Выполнено Тогда
			ТелефоныЗадачОшибкиЗакрытия = ТелефоныЗадачОшибкиЗакрытия+Выб.Телефон+ ";";
		КонецЕсли;
	КонецЦикла;

	//Если были ошибки закрытия задач
	//--------------------------------
	Если ЗначениеЗаполнено(ТелефоныЗадачОшибкиЗакрытия) Тогда
		ЗаписьЖурналаРегистрации("Возникали ошибки автозакрытия задач, по которым не было прозвона", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("ДатаПостановки = %1; Телефоны задач с ошибками закрытия = %2", ДатаПостановки, ТелефоныЗадачОшибкиЗакрытия));
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
